## **Build a Mini Student Management System**
✔ Add Student

✔ Remove Student

✔ Modify Student Marks

✔ Calculate Total Marks

✔ Calculate Percentage

✔ Assign Grade using if-else

✔ Menu System for demonstration

In [136]:
import pandas as pd

# 1. Starting data
result = {
    'name': ['Alpha','Bravo','Charlie','Delta','Echo','Foxtrot','Golf','Hotel','India','Juliet'],
    'roll No': [11,22,33,44,55,66,77,88,99,111],
    'python': [78,67,89,90,91,72,76,89,67,85],
    'excel': [89,87,67,74,78,90,76,78,90,54],
    'power_bi': [45,67,89,87,67,90,65,67,56,90],
    'pandas': [81,85,89,87,41,45,96,56,93,78],
    'machine_learning': [96,95,84,85,82,81,74,75,96,90],
    'statistics': [67,48,45,98,75,71,70,60,90,93]
}

df = pd.DataFrame(result)
df

,name,roll No,python,excel,power_bi,pandas,machine_learning,statistics
0,Alpha,11,78,89,45,81,96,67
1,Bravo,22,67,87,67,85,95,48
2,Charlie,33,89,67,89,89,84,45
3,Delta,44,90,74,87,87,85,98
4,Echo,55,91,78,67,41,82,75
5,Foxtrot,66,72,90,90,45,81,71
6,Golf,77,76,76,65,96,74,70
7,Hotel,88,89,78,67,56,75,60
8,India,99,67,90,56,93,96,90
9,Juliet,111,85,54,90,78,90,93

## **What is Pandas?**

**Pandas is a Python library used to work with structured data (tables).**
**It helps with:**

**Reading data (CSV, Excel, SQL, etc.)**

**Creating and managing tables**

**Adding & deleting rows/columns**

**Filtering data**

**Doing calculations (sum, average, etc.)**

**Data cleaning**

**Analysis**

**Pandas mainly uses two structures:**

**✔ Series → One-dimensional data (like a single column).**

**✔ DataFrame → Rows + Columns (Excel-like table).**

In [134]:
# # Option 1 — Using .insert() (Recommended for inserting a new column at specific position)

# # Suppose you added a new subject CIT but it appears at the end. You want it right after machine_learning.

# # # First, remove the column if it exists at the end
# # cit_data = df.pop('CIT')  # removes CIT column and stores it in a variable

# # # Then insert it at the desired position (after 'machine_learning')
# # position = df.columns.get_loc('machine_learning') + 1  # find index of machine_learning
# # df.insert(position, 'CIT', cit_data)

# # df


# # ✅ Now, CIT appears right after machine_learning.

# # OR

# new_order = ['name', 'roll No', 'python', 'excel', 'power_bi', 'pandas', 'M-L', 'CIT', 'statistics', 'Total Marks', 'Obtained Marks', 'Percentage', 'Grade']

# df = df[new_order]
# df

In [120]:
# df.drop([10, 11], inplace=True)
# df

In [127]:

# df.reset_index(drop=True, inplace=True)   # reindex sequentially
# df

In [137]:
# Option A: Initialize with zeros for all existing students
df['CIT'] = 0

# Option B: If you have actual marks, supply a list equal to len(df)
df['CIT'] = [65, 70, 72, 80, 77, 69, 74, 60, 88, 91]

df

,name,roll No,python,excel,power_bi,pandas,machine_learning,statistics,CIT
0,Alpha,11,78,89,45,81,96,67,65
1,Bravo,22,67,87,67,85,95,48,70
2,Charlie,33,89,67,89,89,84,45,72
3,Delta,44,90,74,87,87,85,98,80
4,Echo,55,91,78,67,41,82,75,77
5,Foxtrot,66,72,90,90,45,81,71,69
6,Golf,77,76,76,65,96,74,70,74
7,Hotel,88,89,78,67,56,75,60,60
8,India,99,67,90,56,93,96,90,88
9,Juliet,111,85,54,90,78,90,93,91

In [138]:
df = df.rename(columns={'machine_learning': 'M-L'})
df.columns  # verify the column name change

Index(['name', 'roll No', 'python', 'excel', 'power_bi', 'pandas', 'M-L',
       'statistics', 'CIT'],
      dtype='object')

In [139]:
# Define subject list and compute Obtained Marks (sum of subject marks) and Total Marks (maximum possible)

# Here we treat Max per subject = 100. MaxTotal is number_of_subjects × 100.
# (You can change max_per_subject if needed.)
# list the subject columns used for marks (order doesn't matter)
subjects = ['python','excel','power_bi','pandas','M-L','CIT','statistics']

# make sure subject columns are numeric
for c in subjects:
    df[c] = pd.to_numeric(df[c], errors='coerce').fillna(0).astype(int)

# Obtained (sum of marks)
df['Obtained Marks'] = df[subjects].sum(axis=1)

# Total (maximum possible marks)
max_per_subject = 100
df['Total Marks'] = len(subjects) * max_per_subject

df[['name','roll No'] + subjects + ['Obtained Marks','Total Marks']]

,name,roll No,python,excel,power_bi,pandas,M-L,CIT,statistics,Obtained Marks,Total Marks
0,Alpha,11,78,89,45,81,96,65,67,521,700
1,Bravo,22,67,87,67,85,95,70,48,519,700
2,Charlie,33,89,67,89,89,84,72,45,535,700
3,Delta,44,90,74,87,87,85,80,98,601,700
4,Echo,55,91,78,67,41,82,77,75,511,700
5,Foxtrot,66,72,90,90,45,81,69,71,518,700
6,Golf,77,76,76,65,96,74,74,70,531,700
7,Hotel,88,89,78,67,56,75,60,60,485,700
8,India,99,67,90,56,93,96,88,90,580,700
9,Juliet,111,85,54,90,78,90,91,93,581,700

In [140]:
df['Percentage'] = (df['Obtained Marks'] / df['Total Marks']) * 100
# round for display if you like:
df['Percentage'] = df['Percentage'].round(2)

df[['name','Obtained Marks','Total Marks','Percentage']]

      name  Obtained Marks  Total Marks  Percentage
0    Alpha             521          700       74.43
1    Bravo             519          700       74.14
2  Charlie             535          700       76.43
3    Delta             601          700       85.86
4     Echo             511          700       73.00
5  Foxtrot             518          700       74.00
6     Golf             531          700       75.86
7    Hotel             485          700       69.29
8    India             580          700       82.86
9   Juliet             581          700       83.00

In [141]:
# Add Grade (A+ → D) using your thresholds

# You said: A+ for 80 and above, A for 70–79.99, etc. — I'll implement:

# A+ : >= 80

# A : >= 70 and < 80

# B : >= 60 and < 70

# C : >= 50 and < 60

# D : otherwise

def grade_from_percent(p):
    if p >= 80:
        return 'A+'
    elif p >= 70:
        return 'A'
    elif p >= 60:
        return 'B'
    elif p >= 50:
        return 'C'
    else:
        return 'D'

df['Grade'] = df['Percentage'].apply(grade_from_percent)
df[['name','Percentage','Grade']]

      name  Percentage Grade
0    Alpha       74.43     A
1    Bravo       74.14     A
2  Charlie       76.43     A
3    Delta       85.86    A+
4     Echo       73.00     A
5  Foxtrot       74.00     A
6     Golf       75.86     A
7    Hotel       69.29     B
8    India       82.86    A+
9   Juliet       83.00    A+

In [142]:
# Add one new student (full row) and recalculate derived columns
# Add a single student with all required fields (including CIT and M-L). After adding, recalc Obtained Marks, Total Marks, Percentage, Grade.
# example new student data (edit values as you want)
new_student = {
    'name': 'Lima',
    'roll No': 556,
    'python': 83,
    'excel': 77,
    'power_bi': 68,
    'pandas': 88,
    'M-L': 87,
    'statistics': 79,
    'CIT': 84
}

# append new student (preserves existing columns)
df = pd.concat([df, pd.DataFrame([new_student])], ignore_index=True, sort=False)

# ensure numeric & fill any missing subject columns
for c in subjects:
    if c not in df.columns:
        df[c] = 0
    df[c] = pd.to_numeric(df[c], errors='coerce').fillna(0).astype(int)

# recalc derived fields
df['Obtained Marks'] = df[subjects].sum(axis=1)
df['Total Marks'] = len(subjects) * max_per_subject
df['Percentage'] = (df['Obtained Marks'] / df['Total Marks'] * 100).round(2)
df['Grade'] = df['Percentage'].apply(grade_from_percent)

# show the newly added student row
df.tail(3)

,name,roll No,python,excel,power_bi,pandas,M-L,statistics,CIT,Obtained Marks,Total Marks,Percentage,Grade
8,India,99,67,90,56,93,96,90,88,580,700,82.86,A+
9,Juliet,111,85,54,90,78,90,93,91,581,700,83.00,A+
10,Lima,556,83,77,68,88,87,79,84,566,700,80.86,A+

In [ ]:
# (Optional) Reindex sequentially or start index at 1

# If you want a clean sequential index from 0:

# df = df.reset_index(drop=True)


# Or to start index at 1 and keep it as a column:
df = df.reset_index(drop=True)
df.index = df.index + 1
df.index.name = 'Index'
df.head()

,name,roll No,python,excel,power_bi,pandas,M-L,statistics,CIT,Obtained Marks,Total Marks,Percentage,Grade
Index,,,,,,,,,,,,,
1,Alpha,11,78,89,45,81,96,67,65,521,700,74.43,A
2,Bravo,22,67,87,67,85,95,48,70,519,700,74.14,A
3,Charlie,33,89,67,89,89,84,45,72,535,700,76.43,A
4,Delta,44,90,74,87,87,85,98,80,601,700,85.86,A+
5,Echo,55,91,78,67,41,82,75,77,511,700,73.00,A

In [ ]:
df.to_csv('students_final.csv', index=False)
# or to Excel:
# df.to_excel('students_final.xlsx', index=False)